Extend Below Base needs to be less than Landing Base Elevation.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ExtendBelowBaseGreaterThanLandingBaseElevation { get; }
  Visual Basic
Public Shared ReadOnly Property ExtendBelowBaseGreaterThanLandingBaseElevation As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ExtendBelowBaseGreaterThanLandingBaseElevation {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace